backend/app/services/slot_machine.rb

UPDATE "game_sessions" SET "credits" = 49, "updated_at" = '2025-12-23 03:08:19.317078' WHERE "game_sessions"."id" = 5
UPDATE "game_sessions" SET "credits" = 9, "updated_at" = '2025-12-23 01:14:43.593282' WHERE "game_sessions"."id" = 3
---
  def update_credits
    if @win
      @game_session.update!(credits: @game_session.credits + @reward - 1)
    else
      @game_session.update!(credits: @game_session.credits - 1)