backend/app/controllers/api/v1/game_sessions_controller.rb

  def create
    @game_session = GameSession.new
    if @game_session.save
---
INSERT INTO "game_sessions" ("session_token", "credits", "cashed_out", "created_at", "updated_at") VALUES ('8cef31676ee6a8b551a0ff869baf8f65', 10, FALSE, '2025-12-23 01:14:32.642464', '2025-12-23 01:14:32.642464') RETURNING "id"

  def cash_out
    if @game_session.cashed_out
      render json: { error: "Session already cashed out" }, status: :unprocessable_entity
      return
    end

    credits_cashed = @game_session.credits
    @game_session.update!(cashed_out: true)
---
UPDATE "game_sessions" SET "cashed_out" = TRUE, "updated_at" = '2025-12-23 03:24:44.084120' WHERE "game_sessions"."id" = 7

  def set_game_session
    @game_session = GameSession.find_by!(session_token: params[:session_token])
---
SELECT "game_sessions".* FROM "game_sessions" WHERE "game_sessions"."session_token" = 'cfa59781624a2f335c749b1b71c5e6ec' LIMIT 1